# Project 1: Driving Licenses, Traffic Accidents and Casualties Analysis

## Problem Statment

Craft your problem statement here using the prompt from the README and other sources you find during your investigation.

## Executive Summary
Write an executive summary that summarizes the problem and your key findings.

### Contents:
- [Datasets Description](#Datasets-Description)
- [Data Import & Cleaning](#Data-Import-and-Cleaning)
- [Exploratory Data Analysis](#Exploratory-Data-Analysis)
- [Data Visualization](#Visualize-the-data)
- [Descriptive and Inferential Statistics](#Descriptive-and-Inferential-Statistics)
- [Outside Research](#Outside-Research)
- [Conclusions and Recommendations](#Conclusions-and-Recommendations)

**If you combine your problem statement, executive summary, data dictionary, and conclusions/recommendations, you have an amazing README.md file that quickly aligns your audience to the contents of your project.** Don't forget to cite your data sources!

*All libraries used should be added here, including any Jupyter magic commands*

In [236]:
#Imports
import pandas as pd

## Datasets Description

[Driving Licenses](https://datasource.kapsarc.org/explore/dataset/saudi-arabia-driving-licenses-issued-in-the-kingdom-2004-2008/information/?disjunctive.administritive_area&sort=time_period&location=5,24.37495,45.08024&basemap=jawg.streets)
This dataset contains Saudi Arabia Driving Licenses Issued By Administrative Area for 1993 - 2016. Data from General Authority for Statistics . Follow datasource.kapsarc.org for timely data to advance energy economics research.

[Traffic Accidents and Casualties](https://datasource.kapsarc.org/explore/dataset/saudi-arabia-traffic-accidents-and-casualties-injured-dead-2008/export/?disjunctive.region&disjunctive.indicator&sort=time_period)
This dataset contains Saudi Arabia Traffic Accidents and Casualties by Region for 2016. Data from General Authority for Statistics. Follow datasource.kapsarc.org for timely data to advance energy economics research.

## Data Import and Cleaning

#### 1. Read In Driving Licenses & Traffic Accidents Data
Read in the `saudi-arabia-traffic-accidents-2008.csv` and `saudi-arabia-driving-licenses-2004-2008.csv` files and assign them to appropriately named pandas dataframes.

In [237]:
#Code
df_traf= pd.read_csv('../data/saudi-arabia-traffic-accidents-2008.csv',sep=';')
df_driv=pd.read_csv('../data/saudi-arabia-driving-licenses-2004-2008.csv',sep=';')

#### 2. Display data

Print the first 10 rows of each dataframe to your jupyter notebook

In [238]:
#Code
df_traf.head(10)

,Unnamed: 0,Unnamed: 0.1,Year,Region,Indicator,Value,geo_point_2d
0,0,0,(2016),Makkah,No. of Casualties - Injured,12383n,"21.628962766, 41.2636898334"
1,1,1,(2016),Eastern Region,No. of Casualties - Dead,1113n,"23.2883307307, 50.1478302439"
2,2,2,(2016),Tabouk,No. of Casualties - Dead,434n,"27.90165499, 37.2598581394"
3,3,3,(2016),Hail,No. of Casualties - Dead,299n,"27.400845724, 41.4406960508"
4,4,4,(2016),Hail,No. of Accidents,10199n,"27.400845724, 41.4406960508"
5,5,5,(2016),Northern Boarder,No. of Casualties - Dead,193n,"30.197074783, 41.8171186952"
6,6,6,(2017),Jazan,No. of Accidents,22161n,"17.2072313962, 42.6525807422"
7,7,7,(2017),Al-Jouf,No. of Accidents,10469n,"29.9677445762, 39.5570371172"
8,8,8,(2017),Total,No. of Casualties - Dead,7489n,NaN
9,9,9,(2016),Northern Boarder,No. of Casualties - Injured,631n,"30.197074783, 41.8171186952"

In [239]:
df_driv.head(10)

,Unnamed: 0,Year,Administritive Area,Driving Liceses,geo_point_2d
0,0,(2012),Makkah,143954n,"21.628962766, 41.2636898334"
1,1,(1994),Makkah,75349n,"21.628962766, 41.2636898334"
2,2,(1998),Makkah,86082n,"21.628962766, 41.2636898334"
3,3,(2004),Makkah,86636n,"21.628962766, 41.2636898334"
4,4,(2005),Makkah,65099n,"21.628962766, 41.2636898334"
5,5,(2008),Makkah,77013n,"21.628962766, 41.2636898334"
6,6,(2014),Madinah,31447n,"24.927534539, 39.4918237173"
7,7,(2013),Madinah,28513n,"24.927534539, 39.4918237173"
8,8,(2012),Madinah,14459n,"24.927534539, 39.4918237173"
9,9,(1994),Madinah,3767n,"24.927534539, 39.4918237173"

#### 3. Briefly describe the data

Take your time looking through the data and briefly describe the data in the markdown cell below. Note things about what the columns might mean, and the general information that is conveyed in the dataframe.

Answer:

#### 4a. How complete is the data?

Investigate missing values etc.

In [240]:
#Code
df_traf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 7 columns):
Unnamed: 0      84 non-null int64
Unnamed: 0.1    84 non-null int64
Year            84 non-null object
Region          84 non-null object
Indicator       84 non-null object
Value           84 non-null object
geo_point_2d    78 non-null object
dtypes: int64(2), object(5)
memory usage: 4.7+ KB

In [241]:
df_driv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 5 columns):
Unnamed: 0             350 non-null int64
Year                   350 non-null object
Administritive Area    350 non-null object
Driving Liceses        350 non-null object
geo_point_2d           325 non-null object
dtypes: int64(1), object(4)
memory usage: 13.8+ KB

#### 4b. Are there any obvious issues with the observations?

**What is the minimum *possible* value for each dataset? What is the maximum *possible* value?**

In [242]:
#Code
print ("Maximum:")
print(df_traf.max(),"\n")
print ("Minimum:")
print(df_traf.min(),"\n")

Maximum:
Unnamed: 0                               83
Unnamed: 0.1                             83
Year                                 (2017)
Region                                Total
Indicator       No. of Casualties - Injured
Value                                99925n
dtype: object

Minimum:
Unnamed: 0                     0
Unnamed: 0.1                   0
Year                      (2016)
Region                  Al-Baaha
Indicator       No. of Accidents
Value                      1007n
dtype: object

In [243]:
#Code
print ("Maximum:")
print(df_driv.max(),"\n")
print ("Minimum:")
print(df_driv.min(),"\n")

Maximum:
Unnamed: 0                349
Year                   (2017)
Administritive Area     Total
Driving Liceses         9983n
dtype: object

Minimum:
Unnamed: 0                   0
Year                    (1993)
Administritive Area    Al-Baha
Driving Liceses        100291n
dtype: object

#### 5. What are your data types? 
Display the data types of each feature.

In [244]:
#Code
print ("Driving Licenses DataSete:")
print(df_driv.dtypes,"\n")
print ("Traffic Accidents DataSete:")
print(df_traf.dtypes,"\n")

Driving Licenses DataSete:
Unnamed: 0              int64
Year                   object
Administritive Area    object
Driving Liceses        object
geo_point_2d           object
dtype: object

Traffic Accidents DataSete:
Unnamed: 0       int64
Unnamed: 0.1     int64
Year            object
Region          object
Indicator       object
Value           object
geo_point_2d    object
dtype: object

What did you learn?
- Do any of them seem odd?  
- Which ones are not as they should be?

Answer: 
##### Do any of them seem odd?  

- character "n" are odd value in the  `Value` columne from `Traffic Accidents and Casualties` dataset and in `Driving Liceses` columne from `Driving Licenses` dataset.

- the columne `Unnamed: 0`,`Unnamed: 0.1` in the datasetes are vrye odd columne and unnessry data.

##### Which ones are not as they should be?  
- should remove `n` from `Value` and `Driving Liceses`  and the type should be integer not str or object
- should remove  `()` form `Year` columne in the datasetes

#### 6. Fix incorrect data types
Based on what you discovered above, use appropriate methods to re-type incorrectly typed data.
- Define a function that will allow you to / numerical columns to an appropriate numeric type. Use `map` or `apply` to change these columns in each dataframe.

In [245]:
#code
df_driv['Driving Liceses']=df_driv['Driving Liceses'].apply(lambda x:x.rstrip('n')).astype(int)

df_traf['Value']=df_traf['Value'].apply(lambda x:x.rstrip('n')).astype(int)

In [246]:
df_driv.head()

,Unnamed: 0,Year,Administritive Area,Driving Liceses,geo_point_2d
0,0,(2012),Makkah,143954,"21.628962766, 41.2636898334"
1,1,(1994),Makkah,75349,"21.628962766, 41.2636898334"
2,2,(1998),Makkah,86082,"21.628962766, 41.2636898334"
3,3,(2004),Makkah,86636,"21.628962766, 41.2636898334"
4,4,(2005),Makkah,65099,"21.628962766, 41.2636898334"

In [247]:
df_driv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 5 columns):
Unnamed: 0             350 non-null int64
Year                   350 non-null object
Administritive Area    350 non-null object
Driving Liceses        350 non-null int32
geo_point_2d           325 non-null object
dtypes: int32(1), int64(1), object(3)
memory usage: 12.4+ KB

In [248]:
df_traf.head()

,Unnamed: 0,Unnamed: 0.1,Year,Region,Indicator,Value,geo_point_2d
0,0,0,(2016),Makkah,No. of Casualties - Injured,12383,"21.628962766, 41.2636898334"
1,1,1,(2016),Eastern Region,No. of Casualties - Dead,1113,"23.2883307307, 50.1478302439"
2,2,2,(2016),Tabouk,No. of Casualties - Dead,434,"27.90165499, 37.2598581394"
3,3,3,(2016),Hail,No. of Casualties - Dead,299,"27.400845724, 41.4406960508"
4,4,4,(2016),Hail,No. of Accidents,10199,"27.400845724, 41.4406960508"

In [249]:
df_traf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 7 columns):
Unnamed: 0      84 non-null int64
Unnamed: 0.1    84 non-null int64
Year            84 non-null object
Region          84 non-null object
Indicator       84 non-null object
Value           84 non-null int32
geo_point_2d    78 non-null object
dtypes: int32(1), int64(2), object(4)
memory usage: 4.4+ KB

- Make new columns `x` and `y` using `geo_point_2d`

In [250]:
#code
#df_driv['x']=df_driv['geo_point_2d'].astype(str).apply(lambda x:x.split(',')[0]).astype(float)
#df_driv['y']=df_driv['geo_point_2d'].astype(str).apply(lambda x:x.split(',')[1]).astype(float)

df1 = df_traf.geo_point_2d.str.split(',', expand=True)
df_driv = df_driv.join(df1)
df_driv = df_driv.rename(columns={0:'x', 1:'y'})
df_driv.head()

,Unnamed: 0,Year,Administritive Area,Driving Liceses,geo_point_2d,x,y
0,0,(2012),Makkah,143954,"21.628962766, 41.2636898334",21.628962766,41.2636898334
1,1,(1994),Makkah,75349,"21.628962766, 41.2636898334",23.2883307307,50.1478302439
2,2,(1998),Makkah,86082,"21.628962766, 41.2636898334",27.90165499,37.2598581394
3,3,(2004),Makkah,86636,"21.628962766, 41.2636898334",27.400845724,41.4406960508
4,4,(2005),Makkah,65099,"21.628962766, 41.2636898334",27.400845724,41.4406960508

In [251]:
#code
#df_traf['x']=df_traf['geo_point_2d'].astype(str).apply(lambda x:x.split(',')[0]).astype(float)
#df_traf['y']=df_traf['geo_point_2d'].astype(str).apply(lambda x:x.split(',')[1]).astype(float)

df2 = df_traf.geo_point_2d.str.split(',', expand=True)
df_traf = df_traf.join(df2)
df_traf = df_traf.rename(columns={0:'x', 1:'y'})
df_traf.head()

,Unnamed: 0,Unnamed: 0.1,Year,Region,Indicator,Value,geo_point_2d,x,y
0,0,0,(2016),Makkah,No. of Casualties - Injured,12383,"21.628962766, 41.2636898334",21.628962766,41.2636898334
1,1,1,(2016),Eastern Region,No. of Casualties - Dead,1113,"23.2883307307, 50.1478302439",23.2883307307,50.1478302439
2,2,2,(2016),Tabouk,No. of Casualties - Dead,434,"27.90165499, 37.2598581394",27.90165499,37.2598581394
3,3,3,(2016),Hail,No. of Casualties - Dead,299,"27.400845724, 41.4406960508",27.400845724,41.4406960508
4,4,4,(2016),Hail,No. of Accidents,10199,"27.400845724, 41.4406960508",27.400845724,41.4406960508

In [252]:
df_driv.drop(columns = ['geo_point_2d'],inplace = True)
df_traf.drop(columns = ['geo_point_2d'],inplace = True)

- Fix any individual values preventing other columns from being the appropriate type.

In [253]:
#code
df_driv['Year']=df_driv['Year'].apply(lambda x:x.strip('()')).astype(int)
df_driv.head()

,Unnamed: 0,Year,Administritive Area,Driving Liceses,x,y
0,0,2012,Makkah,143954,21.628962766,41.2636898334
1,1,1994,Makkah,75349,23.2883307307,50.1478302439
2,2,1998,Makkah,86082,27.90165499,37.2598581394
3,3,2004,Makkah,86636,27.400845724,41.4406960508
4,4,2005,Makkah,65099,27.400845724,41.4406960508

In [254]:
df_traf['Year']=df_traf['Year'].apply(lambda x:x.strip('()')).astype(int)
df_traf.head()

,Unnamed: 0,Unnamed: 0.1,Year,Region,Indicator,Value,x,y
0,0,0,2016,Makkah,No. of Casualties - Injured,12383,21.628962766,41.2636898334
1,1,1,2016,Eastern Region,No. of Casualties - Dead,1113,23.2883307307,50.1478302439
2,2,2,2016,Tabouk,No. of Casualties - Dead,434,27.90165499,37.2598581394
3,3,3,2016,Hail,No. of Casualties - Dead,299,27.400845724,41.4406960508
4,4,4,2016,Hail,No. of Accidents,10199,27.400845724,41.4406960508

- Finish your data modifications by making sure the columns are now typed appropriately.

In [255]:
#code
#i do it with the previos steps

- Display the data types again to confirm they are correct.

In [256]:
#Code:
print(df_traf.info())
print("---------------------")
print(df_driv.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 8 columns):
Unnamed: 0      84 non-null int64
Unnamed: 0.1    84 non-null int64
Year            84 non-null int32
Region          84 non-null object
Indicator       84 non-null object
Value           84 non-null int32
x               78 non-null object
y               78 non-null object
dtypes: int32(2), int64(2), object(4)
memory usage: 4.7+ KB
None
---------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
Unnamed: 0             350 non-null int64
Year                   350 non-null int32
Administritive Area    350 non-null object
Driving Liceses        350 non-null int32
x                      78 non-null object
y                      78 non-null object
dtypes: int32(2), int64(1), object(3)
memory usage: 13.8+ KB
None

#### 7. Rename columns
Change the names of the columns to more expressive names so that you can tell the difference the Driving Licenses  columns and the & Traffic Accidents columns. Your solution should map all column names being changed at once (no repeated singular name-changes). **We will be combining these two datasets, and so you should name columns in an appropriate way**.

**Guidelines**:
- Column names should be all lowercase (you will thank yourself when you start pushing data to SQL later in the course)
- Column names should not contain spaces (underscores will suffice--this allows for using the `df.column_name` method to access columns in addition to `df['column_name']`.
- Column names should be unique and informative (the only feature that we actually share between dataframes is the state).
- Please also fix any typos you see in the column names.

In [257]:
#code
df_driv = df_driv.rename(columns = {'Unnamed: 0':'unnamed: 0','Year': 'year', 'Administritive Area': 'region', 'Driving Liceses':'driving_licenses'})
df_driv.head()

   unnamed: 0  year  region  driving_licenses              x               y
0           0  2012  Makkah            143954   21.628962766   41.2636898334
1           1  1994  Makkah             75349  23.2883307307   50.1478302439
2           2  1998  Makkah             86082    27.90165499   37.2598581394
3           3  2004  Makkah             86636   27.400845724   41.4406960508
4           4  2005  Makkah             65099   27.400845724   41.4406960508

In [258]:
#code
df_traf = df_traf.rename(columns ={'Unnamed: 0':'unnamed: 0','Unnamed: 0.1':'unnamed: 0.1','Year':'year', 'Region':'region', 'Indicator':'indicator', 'Value':'value'})
df_traf.head()

,unnamed: 0,unnamed: 0.1,year,region,indicator,value,x,y
0,0,0,2016,Makkah,No. of Casualties - Injured,12383,21.628962766,41.2636898334
1,1,1,2016,Eastern Region,No. of Casualties - Dead,1113,23.2883307307,50.1478302439
2,2,2,2016,Tabouk,No. of Casualties - Dead,434,27.90165499,37.2598581394
3,3,3,2016,Hail,No. of Casualties - Dead,299,27.400845724,41.4406960508
4,4,4,2016,Hail,No. of Accidents,10199,27.400845724,41.4406960508

#### 8. Create a data dictionary

Now that we've fixed our data, and given it appropriate names, let's create a [data dictionary](http://library.ucmerced.edu/node/10249). 

A data dictionary provides a quick overview of features/variables/columns, alongside data types and descriptions. The more descriptive you can be, the more useful this document is.

Example of a Fictional Data Dictionary Entry: 

|Feature|Type|Dataset|Description|
|---|---|---|---|
|**county_pop**|*integer*|2010 census|The population of the county (units in thousands, where 2.5 represents 2500 people).| 
|**per_poverty**|*float*|2010 census|The percent of the county over the age of 18 living below the 200% of official US poverty rate (units percent to two decimal places 98.10 means 98.1%)|

[Here's a quick link to a short guide for formatting markdown in Jupyter notebooks](https://jupyter-notebook.readthedocs.io/en/stable/examples/Notebook/Working%20With%20Markdown%20Cells.html).

Provided is the skeleton for formatting a markdown table, with columns headers that will help you create a data dictionary to quickly summarize your data, as well as some examples. **This would be a great thing to copy and paste into your custom README for this project.**

df_driv Description:

|Feature|Type|Dataset|Description|
|---|---|---|---|
|year|int|Driving_Licenses|The year in which the licence was issued.|
|region|object|Driving_Licenses|Region where the licence issued.| 
|driving_licenses|object|Driving_Licenses|no. of Licences number.|
|x|float|Driving_Licenses|Longtitude coordinate.|
|y|float|Driving_Licenses|Latitude coordinate.|

df_traf Description:

|Feature|Type|Dataset|Description|
|---|---|---|---|
|year|int|Traffic_Accidents|The year in which the accident happened.|
|region|object|Traffic_Accidents|Region where the accident happen issued.|
|driving_licenses|object|Traffic_Accidents|	Licence number.|
|indicator|object|Traffic_Accidents|Type of casualty (dead or injured).|
|value|object|Traffic_Accidents|value that correspond to the type of casualty.|
|x|float|Traffic_Accidents|Longtitude coordinate.|
|y|float|Traffic_Accidents|Latitude coordinate.|

#### 9. Drop unnecessary rows

This study concerns accident and license in regions/area. Please do the followings:
0. Which rows are not associated with regions?
1. Confirm the numbers of all regions add up to total.
2. Remove the rows that are not associated with regions

In [259]:
#Which rows are not associated with regions?
df_driv.region.unique()

#df_driv[df_driv.region == 'Total']
#df_traf[df_traf.region == 'Total']

array(['Makkah', 'Madinah', 'Al-Qaseem', 'Eastern', 'Assir', 'Tabouk',
       'Hail', 'Northern Boarder', 'Jazan', 'Najran', 'Al-Baha',
       'Al-Jouf', 'Total', 'Riyadh'], dtype=object)

- result: 

all row have 'Total' value in `region` column are not associated with regions

In [260]:
#1. Confirm the numbers of all regions add up to total.
sum_record=df_driv[df_driv.region=='Total'].groupby('year').sum()
sum_record

      unnamed: 0  driving_licenses
year
1993          60            294893
1994          61            303520
1995         240            251878
1996         316            237623
1997         315            289296
1998         317            338350
1999         145            332210
2000         163            273238
2001         147            264725
2002         146            282038
2003          62            254858
2004         148            268738
2005         149            251203
2006          63            267508
2007         164            331356
2008         165            330158
2009         150            376275
2010         143            386510
2011         162            400558
2012         144            411204
2013         239            565314
2014         142            625414
2015          58            435439
2016         314            697017
2017          59            928165

In [261]:
#1. Confirm the numbers of all regions add up to total.
sum_record__=df_traf[df_traf.region=='Total'].groupby('year').sum()
sum_record__

      unnamed: 0  unnamed: 0.1   value
year
2016         136           136  580531
2017         145           145  501176

- result:

In [262]:
#2.Remove the rows that are not associated with regions
df_driv=df_driv[df_driv.region!='Total']
df_driv.head()

   unnamed: 0  year  region  driving_licenses              x               y
0           0  2012  Makkah            143954   21.628962766   41.2636898334
1           1  1994  Makkah             75349  23.2883307307   50.1478302439
2           2  1998  Makkah             86082    27.90165499   37.2598581394
3           3  2004  Makkah             86636   27.400845724   41.4406960508
4           4  2005  Makkah             65099   27.400845724   41.4406960508

In [263]:
df_traf=df_traf[df_traf.region!='Total']
df_traf.head()

,unnamed: 0,unnamed: 0.1,year,region,indicator,value,x,y
0,0,0,2016,Makkah,No. of Casualties - Injured,12383,21.628962766,41.2636898334
1,1,1,2016,Eastern Region,No. of Casualties - Dead,1113,23.2883307307,50.1478302439
2,2,2,2016,Tabouk,No. of Casualties - Dead,434,27.90165499,37.2598581394
3,3,3,2016,Hail,No. of Casualties - Dead,299,27.400845724,41.4406960508
4,4,4,2016,Hail,No. of Accidents,10199,27.400845724,41.4406960508

In [264]:
#code

df_driv = df_driv.drop(columns = 'unnamed: 0')
df_traf = df_traf.drop(columns = ['unnamed: 0','unnamed: 0.1'])

print(df_traf.columns)
print("---------------------")
print(df_driv.columns)

Index(['year', 'region', 'indicator', 'value', 'x', 'y'], dtype='object')
---------------------
Index(['year', 'region', 'driving_licenses', 'x', 'y'], dtype='object')

#### 10a. Data formats
Is the License data in long or wide format? How about the Accident data? And why?

In [233]:
#code
print(df_traf)
print("---------------------")
print(df_driv)

    year          region                    indicator  value              x  \
0   2016          Makkah  No. of Casualties - Injured  12383   21.628962766
1   2016  Eastern Region     No. of Casualties - Dead   1113  23.2883307307
2   2016          Tabouk     No. of Casualties - Dead    434    27.90165499
3   2016            Hail     No. of Casualties - Dead    299   27.400845724
4   2016            Hail             No. of Accidents  10199   27.400845724
..   ...             ...                          ...    ...            ...
79  2017            Asir  No. of Casualties - Injured   2368  19.1387847401
80  2017            Hail  No. of Casualties - Injured    773   27.400845724
81  2017        Al-Baaha     No. of Casualties - Dead    134  20.1484058503
82  2017        Al-Baaha             No. of Accidents   1414  20.1484058503
83  2017        Al-Baaha  No. of Casualties - Injured   1007  20.1484058503

                 y
0    41.2636898334
1    50.1478302439
2    37.2598581394
3    41.4406960508
4    41.4406960508
..             ...
79    42.941470036
80   41.4406960508
81   41.4665484892
82   41.4665484892
83   41.4665484892

[78 rows x 6 columns]
---------------------
     year  region  driving_licenses              x               y
0    2012  Makkah            143954   21.628962766   41.2636898334
1    1994  Makkah             75349  23.2883307307   50.1478302439
2    1998  Makkah             86082    27.90165499   37.2598581394
3    2004  Makkah             86636   27.400845724   41.4406960508
4    2005  Makkah             65099   27.400845724   41.4406960508
..    ...     ...               ...            ...             ...
345  2000  Tabouk              8473            NaN             NaN
346  2006  Tabouk              8259            NaN             NaN
347  2013    Hail              9731            NaN             NaN
348  1997    Hail              6606            NaN             NaN
349  1999    Hail              3139            NaN             NaN

[325 rows x 5 columns]

Result:
- License data is wide format
- Accident data is long format becuse 'indicator' column is have multey valuse like{accidents,deaths,injuries}

#### 10b. Changing formats
Which format would work best for both dataframes? Transform the datasets to the same format before merging in the next task.

Answer: 
- the best format would work best for both dataframes is wide format

In [309]:
#code
pivot_table=pd.pivot_table(df_traf,values='value',index=['year','region'],columns='indicator').reset_index().rename_axis(None,axis=1)
pivot_table.columns=['year','region','accidents','deaths','injuries']
pivot_table.head()

#print("---------------------")
 #	unnamed: 0.1 	year 	region 	indicator 	value 	geo_point_2d

   year          region  accidents  deaths  injuries
0  2016        Al-Baaha       3618     185      1227
1  2016         Al-Jouf      10212     245       920
2  2016            Asir      32684     983      2541
3  2016  Eastern Region     101619    1113      4893
4  2016            Hail      10199     299       932

#### 11. Merge dataframes

Join the Driving Licenses & Traffic Accidents dataframes using the **region** and **year** in each dataframe as the key. Assign this to a new variable. Which join should you use to preserve the most data?

In [314]:
#code
df_new=pd.merge(pivot_table, df_driv, how='inner', on='year')
df_new.head()

,year,region_x,accidents,deaths,injuries,region_y,driving_licenses,x,y
0,2016,Al-Baaha,3618,185,1227,Al-Baha,4614,27.400845724,41.4406960508
1,2016,Al-Baaha,3618,185,1227,Northern Boarder,4958,NaN,NaN
2,2016,Al-Baaha,3618,185,1227,Najran,2153,NaN,NaN
3,2016,Al-Baaha,3618,185,1227,Makkah,136055,NaN,NaN
4,2016,Al-Baaha,3618,185,1227,Madinah,24540,NaN,NaN

#### 12. Save your cleaned, merged dataframe

Use a relative path to save out your data as `combined_datasets.csv`.

In [274]:
#code
df_new.to_csv('../data/combined_datasets.csv')

## Exploratory Data Analysis


### Summary Statistics
Transpose the output of pandas `describe` method to create a quick overview of each numeric feature.

In [284]:
#Code:
df_new.describe()

              year          value  driving_licenses
count  1014.000000    1014.000000       1014.000000
mean   2016.500000   13868.038462      62507.000000
std       0.500247   31528.466554     105262.259647
min    2016.000000     112.000000       2153.000000
25%    2016.000000     706.000000       8091.000000
50%    2016.500000    1682.500000      16085.000000
75%    2017.000000   10623.000000      54507.000000
max    2017.000000  145541.000000     495307.000000

#### Manually calculate standard deviation

$$\sigma = \sqrt{\frac{1}{n}\sum_{i=1}^n(x_i - \mu)^2}$$

- Write a function to calculate standard deviation using the formula above

In [294]:
def stan_dev(df_new):
    L=len(List)
    m=np.mean(List)
    count=0
    for i in range(L):
        count+=(List[i]-m)**2
        root=np.sqrt(List)
   
return [ df_new[col].std() for col in 
            df_new.select_dtypes(include = ['float', 'int64']).columns.tolist()]

In [ ]:

def stan_dev(df_new):
    return [ df_new[col].std() for col in 
            df_new.select_dtypes(include = ['float', 'int64']).columns.tolist()]

In [295]:
sd = stan_dev(df_new)
sd

[]

- Use a **dictionary comprehension** to apply your standard deviation function to each numeric column in the dataframe.  **No loops**  
- Assign the output to variable `sd` as a dictionary where: 
    - Each column name is now a key 
    - That standard deviation of the column is the value 
     
*Example Output :* `{'Driving_Licenses_x': 120, 'Traffic_Accidents_x': 120, ...}`

In [317]:
#Code:
def stan_dev_c(df):
    return [ df[col].std() for col in 
            df.select_dtypes(include = ['float', 'int64']).columns.tolist()]

In [319]:
sd = stan_dev_c(df_new)
sd

NameError: name 'stan_dev_c' is not defined

Do your manually calculated standard deviations match up with the output from pandas `describe`? What about numpy's `std` method?

Answer:

#### Investigate trends in the data
Using sorting and/or masking (along with the `.head` method to not print our entire dataframe), consider the following questions:

- Which regions have the highest and lowest Driving Licenses based on years (1993 - 2017)
- Which regions have the highest and lowest mean Traffic Accidents numbers for years (2016 - 2017)
- What are the regions that have more Driving Licenses issued in each year than the year average?
- What are the regions that have more Traffic Accidents happened in each year than the year average?

Based on what you've just observed, have you identified any regions that you're especially interested in? **Make a note of these and state *why* you think they're interesting**.

**You should comment on your findings at each step in a markdown cell below your code block**. Make sure you include at least one example of sorting your dataframe by a column, and one example of using boolean filtering (i.e., masking) to select a subset of the dataframe.

In [ ]:
#code

## Visualize the data

There's not a magic bullet recommendation for the right number of plots to understand a given dataset, but visualizing your data is *always* a good idea. Not only does it allow you to quickly convey your findings (even if you have a non-technical audience), it will often reveal trends in your data that escaped you when you were looking only at numbers.

Some recommendations on plotting:
- Plots have titles
- Plots have axis labels
- Plots have appropriate tick labels
- All text is legible in a plot
- Plots demonstrate meaningful and valid relationships
- Plots are interpreted to aid understanding

There is such a thing as too many plots, and there are a *lot* of bad plots. You might make some! (But hopefully not with the guided prompts below).

#### Use Seaborn's heatmap with pandas `.corr()` to visualize correlations between all numeric features

Heatmaps are generally not appropriate for presentations, and should often be excluded from reports as they can be visually overwhelming. **However**, they can be extremely useful in identify relationships of potential interest (as well as identifying potential collinearity before modeling).

*example*:
```python
sns.heatmap(df.corr())
```

Please take time to format your output, adding a title. Look through some of the additional arguments and options. (Axis labels aren't really necessary, as long as the title is informative).

In [ ]:
sns.heatmap(df.corr())

#### Define a custom function to subplot histograms

We should write a function that will take the names of 2+ columns and subplot histograms. While you can use pandas plotting or Seaborn here, matplotlib gives you greater control over all aspects of your plots.

[Helpful Link for Plotting Multiple Figures](https://matplotlib.org/users/pyplot_tutorial.html#working-with-multiple-figures-and-axes)

Here's some starter code:

In [ ]:
def subplot_histograms(dataframe, list_of_columns, list_of_titles, list_of_xlabels):
    nrows = int(np.ceil(len(list_of_columns)/2) # Makes sure you have enough rows
    fig, ax = plt.subplots(nrows=nrows, ncols=2) # You'll want to specify your figsize
    ax = ax.ravel() # Ravel turns a matrix into a vector, which is easier to iterate
    for i, column in enumerate(list_of_columns): # Gives us an index value to get into all our lists
        ax[i].hist(dataframe[column]) # feel free to add more settings
        # Set titles, labels, etc here for each subplot

#### Plot and interpret histograms 
For each of the following:
- Driving Licenses number
- Traffic Accidents number

Please plot two additional histograms that will help with your understanding of the data

In [ ]:
# Code

#### Plot and interpret scatter plots

For each of the following:
- Driving Licenses vs. Traffic Accidents for 2017
- Driving Licenses vs. Traffic Accidents for 2016
- Driving Licenses for 2016 vs 2017
- Traffic Accidents for 2016 vs 2017

Plot the two variables against each other using matplotlib or Seaborn

Your plots should show:
- Two clearly labeled axes
- A proper title
- Using colors and symbols that are clear and unmistakable

**Feel free to write a custom function, and subplot if you'd like.** Functions save both time and space.

In [ ]:
# Code

#### Plot and interpret boxplots

For each numeric variable in the dataframe create a boxplot using Seaborn. Boxplots demonstrate central tendency and spread in variables. In a certain sense, these are somewhat redundant with histograms, but you may be better able to identify clear outliers or differences in IQR, etc.

Multiple values can be plotted to a single boxplot as long as they are of the same relative scale (meaning they have similar min/max values).

Each boxplot should:
- Only include variables of a similar scale
- Have clear labels for each variable
- Have appropriate titles and labels

In [ ]:
# Code

#### Feel free to do additional plots below
*(do research and choose your own chart types & variables)*

Are there any additional trends or relationships you haven't explored? Was there something interesting you saw that you'd like to dive further into? It's likely that there are a few more plots you might want to generate to support your narrative and recommendations that you are building toward. **As always, make sure you're interpreting your plots as you go**.

## Descriptive and Inferential Statistics

#### Summarizing Distributions

Above, we used pandas `describe` to provide quick summary statistics of our numeric columns. We also demonstrated many visual relationships.

As data scientists, having a complete understanding of data is imperative prior to modeling.

While we will continue to build our analytic tools, we know that measures of *central tendency*, *spread*, and *shape/skewness* provide a quick summary of distributions.

For each variable in your data, summarize the underlying distributions (in words & statistics)
 - Be thorough in your verbal description of these distributions.
 - Be sure to back up these summaries with statistics.

Answers:

#### We generally assuming that data we sample from a population will be normally distributed. Do we observe this trend?

Answer:

Does This Assumption Hold for:
    - Driving Licenses
    - Traffic Accidents
Explain your answers for each distribution and how you think this will affect estimates made from these data.

Answer:

#### Statistical Evaluation of Distributions 

**If you feel it's appropriate**, using methods we discussed in class, run hypothesis tests to compare variables of interest in our dataset.

In [ ]:
# Code

## Outside Research

Based upon your observations, choose **three** regions that demonstrate interesting trends in the number of driving licenses and traffic accidents. Spend some time doing outside research on provincial and central policies that might influence these rates, and summarize your findings below. **Feel free to go back and create new plots that highlight these states of interest**. If you bring in any outside tables or charts, make sure you are explicit about having borrowed them. If you quote any text, make sure that it renders as being quoted. (Make sure that you cite your sources -- check with you local instructor for citation preferences).

Answer:

## Conclusions and Recommendations

- Based on your exploration of the data, what are you key takeaways and recommendations?
- Are there additional data you desire that would better inform your investigations?

Answer: